"""
Напишите фукнцию, которая убирает в строке буквы слева от знака '*'
"""

def solution(string):
    pass


assert solution('abc*') == 'ab'
assert solution('help**sos*') == 'heso'
assert solution('**') == ''
assert solution('he*l**p') == 'p'
print('Решено.')
