"""
Напишите функцию, которая определяет продублированный элемент в массиве.
Массив всегда состоит из элементов типа int от 1 до N.
В массиве дублируется только один элемент.
"""


def solution(nums):
    pass


assert solution([1, 1]) == 1  #
assert solution([1, 2, 2]) == 2
assert solution([1, 2, 3, 3, 4, 5]) == 3
assert solution([6, 4, 5, 3, 2, 2, 1]) == 2
print('Решено.')
